tutorials/DLbuoyantPimpleFoam_auto/array_of_chips/case_3x3/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $flowVelocity;
    }
    front
    {
        type            noSlip;
    }
    top
    {
        type            noSlip;
    }
    bot
    {
        type            noSlip;
    }
   obstacle 
    {
        type            noSlip;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    back
    {
        type            noSlip;
    }
}


// ************************************************************************* //
