tutorials/DLbuoyantPimpleFoam_auto/array_of_chips/case_3x3/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    front
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    top
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    bot
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    obstacle
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    back
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
