tutorials/DLbuoyantPimpleFoam_auto/array_of_chips/case_3x3/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "include/initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $turbulentOmega;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $turbulentOmega;
    }
    front
    {
        type            omegaWallFunction;
        value           uniform $turbulentOmega;
    }
    top
    {
        type            omegaWallFunction;
        value           uniform $turbulentOmega;
    }
    bot
    {
        type            omegaWallFunction;
        value           uniform $turbulentOmega;
    }
    obstacle
    {
        type            omegaWallFunction;
        value           uniform $turbulentOmega;
    }
    outlet
    {
        type            zeroGradient;
    }
    back
    {
        type            omegaWallFunction;
        value           uniform $turbulentOmega;
    }
}


// ************************************************************************* //
