tutorials/DLbuoyantPimpleFoam_auto/array_of_chips/case_3x3/system/MLSamplingDict
FoamFile { version 2.0; format ascii; class dictionary; object MLSamplingDict; }

warmUpSteps     10;
burstSteps      10;
regularInterval 5;
retrainInterval 10;
