tutorials/DLbuoyantPimpleFoam_auto/array_of_chips/case_3x3/system/extrudeMeshDict_front
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}

constructFrom mesh;
sourceCase ".";
sourcePatches    (front);
extrudeType      patchNormal;
exposedPatchName front;
direction (0 -1 0);

flipNormals false;

extrudeModel linearDirection;

expansionRatio 1;
firstLayerThickness 0.001;
nLayers 6;

linearDirectionCoeffs
{
    direction (0 -1 0);
    thickness 0.006;
}

mergeFaces false;
mergeTol 0;
